circuitvalley/TMS320_DSP/moving_avg_filter_vc5502/lib/csl_intc.c


/** @file csl_intc.c
 *
 *  @brief INTC functional layer API source file
 *
 *  Path: \\(CSLPATH)\\src
 */

/* ============================================================================
 * Revision History
 * 13-Aug-2010 CSL v2.10 release
 * 06-Jul-2011 CSL v2.50 release
 * 13-Sep-2012 CSL v3.00 release
 * 20-Dec-2012 CSL v3.01 release
 * ================
 *
 * ============================================================================
 */
#include "csl_intc.h"
#include "csl_i2c.h"
#include "tms320vc5502.h"

/** ============================================================================
 *   @n@b IRQ_init
 *
 *   @b Description
 *   @n This is the initialization function for INTC module. This function
 *      initializes the CSL INTC data structures
 *
 *
 *   @b Arguments
 *   @verbatim
       dispatchTable - Dispatch table
       biosPresent   - DspBios is present or not
 *   @endverbatim
 *
 *   <b> Return Value </b>  CSL_Status
 *   @li                    CSL_SOK - IRQ_init is successful
 *   @li                    CSL_ESYS_INVPARAMS  - Invalid parameter
 *   <b> Pre Condition </b>
 *   @n  None
 *
 *   <b> Post Condition </b>
 *   @n  Initializes CSL data structures
 *
 *
 *   @b Modifies
 *   @n    1. The status variable
 *   @n    2. Update CSL_IrqDataObj structure
 *
 *   @b Example
 *   @verbatim
            CSL_Status            status;
            CSL_IRQ_Dispatch     dispatchTable
            ...

            status = IRQ_init(&dispatchTable,0);
            ...

    @endverbatim
 *  ============================================================================
 */

//CSL_Status IRQ_init (
//CSL_IRQ_Dispatch *dispatchTable,
//Uint16            biosPresent
//)
//{
//    int i;
//
//    if( INV == dispatchTable )
//    {
//        return CSL_ESYS_INVPARAMS;
//    }
//
//    CSL_IRQ_DATA.IrqDispatchTable = dispatchTable;
//
//    for (i=0; i<=IRQ_EVENT_CNT-1; i++)
//        CSL_IRQ_DATA.IrqIntTable[i] = i;
//
//    for(i=0; i<= IRQ_EVENT_CNT-1; i++)
//        CSL_IRQ_DATA.IrqEventTable[i] = IRQ_MASK32(i);
//
//    CSL_IRQ_DATA.biosPresent = biosPresent;
//    return CSL_SOK;
//}

/** ============================================================================
 *   @n@b IRQ_clear
 *
 *   @b Description
 *   @n This function acknowledge the interrupt by clearing
 *      the corresponding Interrupt flag .
 *
 *   @b Arguments
 *   @verbatim
            eventId          Event Id for the peripheral in IFR Register
     @endverbatim
 *
 *   <b> Return Value </b>  CSL_Status
 *   @li                    CSL_SOK             - INTC_close is successful
 *   @li                    CSL_ESYS_INVPARAMS  - Invalid handle
 *
 *   <b> Pre Condition </b>
 *   @n  IRQ_setVecs and IRQ_plug API should be called
 *     before calling this API
 *
 *   <b> Post Condition </b>
 *   @n  IFR Register bit will be cleared
 *
 *   @b Modifies
 *   @n    1. The status variable
 *   @n    2. IFR Register
 *   @b Example
 *   @verbatim
            Uint16           EventId;
            CSL_status       status;

            ...

            status = IRQ_clear(EventId);
     @endverbatim
 *  ============================================================================
 */

CSL_Status IRQ_clear (
Uint16          EventId
)
{
    Uint16 bit;
    Bool old_intm;

    /* Wrong Event Id */
    if (SINT31_EVENT < EventId)
    {
        return CSL_ESYS_INVPARAMS;
    }

    old_intm = IRQ_globalDisable();

    bit = EventId;

    if(EventId > RCV2_EVENT)
    {
        /* IFR1 Register */
        bit = 0x0001 << (EventId - (RCV2_EVENT+1));
	IFR1 = bit;
    }
    else
    {
        /* IFR0 Register */
	bit = 0x0001 << EventId;
       IFR0 = bit;
    }

    IRQ_globalRestore(old_intm);
    return CSL_SOK;
}

/** ============================================================================
 *   @n@b IRQ_clearAll
 *
 *   @b Description
 *   @n This function clears all the interrupts. Both IFR0 and IFR1 are cleared
 *      by this function.
 *
 *   @b Arguments
 *   @verbatim
            None
     @endverbatim
 *
 *   <b> Return Value </b>  None
 *
 *   <b> Pre Condition </b>
 *   @n  None
 *
 *   <b> Post Condition </b>
 *   @n  Clears All the interrupt
 *
 *   @b Modifies
 *   @n    Interrupt Flag Registers
 *
 *   @b Example
 *   @verbatim
            IRQ_clearAll();
     @endverbatim
 *  ============================================================================
 */
void IRQ_clearAll(void)
{
	/* Clear IFR0 */
   IFR0 = CSL_INTC_IFR_RESET;

	/* Clear IFR1 */
	IFR1 = CSL_INTC_IFR_RESET;
}

/** ============================================================================
 *   @n@b IRQ_config
 *
 *   @b Description
 *   @n This API function is used to update ISR function
 *      and its arguments passed in config structure for
 *      the corresponding event in dispatch table
 *   @b Arguments
 *   @verbatim
            EventId         Id for peripheral in IFR and IER Registers .

            config          Config structure

 *   @endverbatim
 *
 *   <b> Return Value </b>  CSL_Status
 *   @li                    CSL_SOK            - IRQ_config call is successful
 *   @li                    CSL_ESYS_BADHANDLE - Invalid handle
 *   @li                    CSL_ESYS_INVPARAMS - Invalid parameter
 *
 *   <b> Pre Condition </b>
 *   @n  IRQ_init API should be called before this API call
 *
 *   <b> Post Condition </b>
 *   @n  It updates CSL_IrqDataObj structure
 *   @b Modifies
 *   @n    1. The status variable
 *   @n    2. Hardware Registers
 *
 *   @b Example
 *   @verbatim
         interrupt void ISR_routine(void);
         CSL_Status     status;
         // Adress for interrupt vector table
         extern void VECSTART(void);
         IRQ_Config     config;
         Uint16         EventId;
         status = IRQ_init();
         ...
         // to set the interrupt vector table address
         IRQ_setVecs((Uint32)&VECSTART);
         ...
         config.funcAddr = &ISR_routine;
         status = IRQ_config(EventId,&config);
         ...
    @endverbatim
 *  ============================================================================
 */

//CSL_Status IRQ_config (
//Uint16     EventId,
//CSL_IRQ_Config *config
//)
//{
//    if(NULL == config)
//    {
//        return CSL_ESYS_INVPARAMS;
//    }
//
//    /* Wrong Event Id */
//    if(SINT31_EVENT < EventId)
//    {
//        return CSL_ESYS_INVPARAMS;
//    }
//
//    CSL_IRQ_DATA.IrqDispatchTable[EventId].funcAddr
//    = config->funcAddr;
//
//    CSL_IRQ_DATA.IrqDispatchTable[EventId].funcArg
//    = config->funcArg;
//
//    CSL_IRQ_DATA.IrqDispatchTable[EventId].ierMask = config->ierMask ;
//
//    CSL_IRQ_DATA.IrqDispatchTable[EventId].cacheCtrl = config->cacheCtrl;
//
//    return CSL_SOK;
//}



/** ============================================================================
 *   @n@b IRQ_getConfig
 *
 *   @b Description
 *   @n It reads the configuration values (function address,arguments etc)
 *   from global IRQ data object structure
 *   @b Arguments
 *   @verbatim
          EventId         Id for peripheral in IFR and IER Registers

          config          Config structure
     @endverbatim
 *
 *   <b> Return Value </b>  CSL_Status
 *   @li                    CSL_SOK           - IRQ_getConfig is successfull
 *
 *   @li                    CSL_ESYS_BADHANDLE - The handle is passed is
 *                                                invalid
 *   @li                    CSL_ESYS_INVPARAMS - Invalid parameter
 *
 *   <b> Pre Condition </b>
 *   @n  IRQ_config should be called before calling this API
 *
 *   <b> Post Condition </b>
 *   @n  The configuration structure will be populated
 *
 *   @b Modifies
 *   @n 1.status
 *      2.config structure
 *   @b Example
 *   @verbatim
        // Global IRQ object structure
         CSL_IrqDataObj  CSL_IrqData;
         CSL_Status     status;
         IRQ_Config     config;
         Uint16         EventId;
            ...
            status = IRQ_config(EventId,&config);
             ...
            status = IRQ_getConfig(EventId,&config);
     @endverbatim
 *  ============================================================================
 */

//CSL_Status IRQ_getConfig (
//Uint16          EventId,
//CSL_IRQ_Config  *config
//)
//{
//    if(NULL == config)
//    {
//        return CSL_ESYS_INVPARAMS;
//    }
//    /* Wrong Event Id */
//    if(SINT31_EVENT < EventId)
//    {
//        return CSL_ESYS_INVPARAMS;
//    }
//    config->funcAddr =
//    (IRQ_IsrPtr)CSL_IRQ_DATA.IrqDispatchTable[EventId].funcAddr;
//
//    config->funcArg
//    = CSL_IRQ_DATA.IrqDispatchTable[EventId].funcArg ;
//
//    config->ierMask = CSL_IRQ_DATA.IrqDispatchTable[EventId].ierMask;
//
//    config->cacheCtrl = CSL_IRQ_DATA.IrqDispatchTable[EventId].cacheCtrl;
//
//    return CSL_SOK;
//}

/** ============================================================================
 *   @n@b IRQ_disable
 *
 *   @b Description
 *   @n It disables the corresponding interrupt in IER Register and
 *      also return the previous bit mask value
 *
 *   @b Arguments
 *   @verbatim
            EventId         Id for peripheral in IFR and IER Registers

 *   @endverbatim
 *
 *   <b> Return Value </b>
 *         IER Register value before enabling
 *
 *   <b> Pre Condition </b>
 *   @n IRQ_setVecs andIRQ_plug API should be called
 *     before calling this API
 *
 *   <b> Post Condition </b>
 *   @n  It disabled the corresponding interrupt bit in IER Register
 *
 *   @b Modifies
 *   @n IER h/w Registers
 *
 *   @b Example
 *   @verbatim
            Uint16         EventId;
            int            old_IER;

