circuitvalley/TMS320_DSP/moving_avg_filter_vc5502/lib/csl_intc.c
            old_IER = IRQ_disable(EventId);
     @endverbatim
 *  ============================================================================
 */

int IRQ_disable (
Uint16          EventId
)
{
    Uint16 bit;
    int old_flag;
    Bool old_intm;
    /* Wrong Event Id */
    if(SINT31_EVENT < EventId)
    {
        return CSL_ESYS_INVPARAMS;
    }

    bit = EventId;
    old_intm = IRQ_globalDisable();
    /* EventId greater than 15 */
    if (EventId > RCV2_EVENT)
    {

        bit = bit - XMT3_EVENT;
        old_flag  = (IER1&(0x0001<<bit))>>bit  ;
        IER1&=~(1<<bit);
    }
    /* EventId less than 15 */
    else
    {
        old_flag = (IER0&(0x0001<<bit))>>bit ;
        IER0&=~(1<<bit);
    }
    IRQ_globalRestore(old_intm);

    return old_flag;
}

/** ============================================================================
 *   @n@b IRQ_disableAll
 *
 *   @b Description
 *   @n This function disables all the interrupts avaible on C5505 DSP. Both
 *      IER0 and IER1 are cleared by this function
 *
 *   @b Arguments
 *   @verbatim
            None

 *   @endverbatim
 *
 *   <b> Return Value </b>
 *         None
 *
 *   <b> Pre Condition </b>
 *   @n None
 *
 *   <b> Post Condition </b>
 *   @n  Disables all the interrupts
 *
 *   @b Modifies
 *   @n Interrupt Enable Registers
 *
 *   @b Example
 *   @verbatim

            IRQ_disableAll();
     @endverbatim
 *  ============================================================================
 */
void IRQ_disableAll (void)
{
	/* Clear IER0 */
	IER0 = CSL_CPU_IER0_RESETVAL;

	/* Clear IER1 */
	IER1 = CSL_CPU_IER1_RESETVAL;
}

/** ============================================================================
 *   @n@b IRQ_enable
 *
 *   @b Description
 *   @n It enables the corresponding interrupt bit in IER Register and
 *      also return the previous bit mask value
 *
 *   @b Arguments
 *   @verbatim
             EventId         Id for peripheral in IFR and IER Registers
 *   @endverbatim
 *
 *   <b> Return Value </b>
 *              IER Register value before enabling
 *
 *   <b> Pre Condition </b>
 *   @n IRQ_setVecs andIRQ_plug API should be called
 *     before calling this API
 *
 *   <b> Post Condition </b>
 *   @n  It set the corresponding interrupt bit to 1 in IER Register
 *
 *   @b Modifies
 *   @n IER CPU Registers
 *
 *   @b Example
 *   @verbatim
            Uint16         EventId;
            int            old_IER;

            old_IER = IRQ_enable(EventId);
     @endverbatim
 *  ============================================================================
 */

int IRQ_enable (
Uint16          EventId
)
{
    Uint16 bit;
    int old_flag;
    Bool old_intm;
    /* Wrong Event Id */
    if (SINT31_EVENT < EventId)
    {
        return CSL_ESYS_INVPARAMS;
    }

    bit= EventId ;
    old_intm = IRQ_globalDisable();
    if (EventId > RCV2_EVENT)
    {
        bit = bit - XMT3_EVENT;
        old_flag = (IER1&(0x0001<<bit))>>bit;
        IER1 |= (0x0001<<bit);
    }
    else
    {
        old_flag = (IER0&(0x0001<<bit))>>bit;
        IER0 |= (0x0001<<bit);
    }

    IRQ_globalRestore(old_intm);

    return old_flag;
}

/** ============================================================================
 *   @n@b IRQ_restore
 *
 *   @b Description
 *   @n It restores the given value in IER Register passed in API
 *
 *   @b Arguments
 *   @verbatim
             EventId         Id for peripheral in IFR and IER Registers
             value           bit value - 1 or 0
 *   @endverbatim
 *
 *   <b> Return Value </b>  CSL_Status
 *   @li                    CSL_SOK      always returns
 *
 *   <b> Pre Condition </b>
 *   @n IRQ_enable or IRQ_disable should be called before calling this API
 *
 *   <b> Post Condition </b>
 *   @n  It configures the given bit value in IER Register
 *
 *   @b Modifies
 *   @n IER CPU Registers
 *
 *   @b Example
 *   @verbatim
            Uint16         EventId;
            int             value;
            CSL_Status     status;
            value = IRQ_enable(EventId);
            ..
            status = IRQ_restore(EventId,value);
     @endverbatim
 *  ============================================================================
 */

CSL_Status IRQ_restore(
Uint16 EventId,
int value
)
{
    Uint16 bit;
    Bool old_intm;

    /* Wrong Event Id */
    if(SINT31_EVENT < EventId)
    {
        return CSL_ESYS_INVPARAMS;
    }

    bit = EventId;
    old_intm = IRQ_globalDisable();
    if(EventId > RCV2_EVENT)
    {
        bit = bit - XMT3_EVENT;
        if(value)
        IER1|=0x0001<<bit;
        else
        IER1&=~(0x0001<<bit);

    }
    else
    {
    	   if(value)
    	   IER0|=0x0001<<bit;
    	   else
    	   IER0&=~(0x0001<<bit);
    }
    IRQ_globalRestore(old_intm);

    return CSL_SOK;
}

/** ============================================================================
 *   @n@b IRQ_getArg
 *
 *   @b Description
 *   @n It gets the ISR function arguments correspond to eventId
 *
 *   @b Arguments
 *   @verbatim
             EventId         Id for peripheral in IFR and IER Registers
 *   @endverbatim
 *
 *   <b> Return Value </b>  CSL_Status
 *   @li                    CSL_SOK             - IRQ_enable is successful
 *   @li                    CSL_ESYS_BADHANDLE  - The handle is passed is
 *                                                invalid
 *   @li                    CSL_ESYS_INVPARAMS -  Invalid parameter
 *
 *   <b> Pre Condition </b>
 *   @n IRQ_init,IRQ_config should be called before calling this API
 *
 *   <b> Post Condition </b>
 *   @n

 *   @b Modifies
 *   @n arg variable
 *
 *   @b Example
 *   @verbatim
            Uint16         EventId;
            Uint32         arg;
            CSL_Status     status;

            status = IRQ_getArg(EventId,&arg);
     @endverbatim
 *  ============================================================================
 */

//CSL_Status IRQ_getArg(
//Uint16      EventId,
//Uint32      *arg
//)
//{
//    if(NULL == arg)
//    {
//        return CSL_ESYS_INVPARAMS;
//    }
//
//    /* Wrong Event Id */
//    if(SINT31_EVENT < EventId)
//    {
//        return CSL_ESYS_INVPARAMS;
//    }
//    *arg = CSL_IRQ_DATA.IrqDispatchTable[EventId].funcArg ;
//
//    return CSL_SOK;
//}

/** ============================================================================
 *   @n@b IRQ_setArg
 *
 *   @b Description
 *   @n It sets the ISR function arguments correspond to the eventId
 *
 *   @b Arguments
 *   @verbatim
             EventId         Id for peripheral in IFR and IMR Registers
             val             value for ISR arguments
 *   @endverbatim
 *
 *   <b> Return Value </b>  CSL_Status
 *   @li                    CSL_SOK             - IRQ_enable is successful
 *   @li                    CSL_ESYS_BADHANDLE  - The handle is passed is
 *                                                invalid
 *   @li                    CSL_ESYS_INVPARAMS -  Invalid parameter
 *
 *   <b> Pre Condition </b>
 *   @n IRQ_init should be called before calling this API
 *
 *   <b> Post Condition </b>
 *   @n

 *   @b Modifies
 *   @n status
 *
 *   @b Example
 *   @verbatim
            // Global IRQ object structure
            CSL_IrqDataObj  CSL_IrqData;
            Uint16         EventId;
            Uint32         val;
            CSL_Status     status;

            status = IRQ_setArg(EventId,val);
     @endverbatim
 *  ============================================================================
 */

//CSL_Status IRQ_setArg(
//Uint16 EventId,
//Uint32 val
//)
//{
//    /* Wrong Event Id */
//    if (SINT31_EVENT < EventId)
//    {
//        return CSL_ESYS_INVPARAMS;
//    }
//    CSL_IRQ_DATA.IrqDispatchTable[EventId].funcArg = val;
//
//    return CSL_SOK;
//}
//

/** ============================================================================
 *   @n@b IRQ_map
 *
 *   @b Description
 *   @n It initialize the interrupt table with the event mask value for
 *   the corresponding event id
 *   @b Arguments
 *   @verbatim
             EventId         Id for peripheral in IFR and IER Registers
 *   @endverbatim
 *
 *   <b> Return Value </b>  CSL_Status
 *   @li                    CSL_SOK             - IRQ_enable is successful
 *   @li                    CSL_ESYS_BADHANDLE  - The handle is passed is
 *                                                invalid
 *   @li                    CSL_ESYS_INVPARAMS -  Invalid parameter
 *
 *   <b> Pre Condition </b>
 *   @n IRQ_init should be called before calling this API
 *
 *   <b> Post Condition </b>
 *   @n

 *   @b Modifies
 *   @n CSL_IrqData structure
 *
 *   @b Example
 *   @verbatim
            Uint16         EventId;
            CSL_Status     status;

            status = IRQ_map(EventId);
     @endverbatim
 *  ============================================================================
 */

CSL_Status IRQ_map(
Uint16 EventId
)
{
    /* Wrong Event Id */
    if (SINT31_EVENT < EventId)
    {
        return CSL_ESYS_INVPARAMS;
    }
    CSL_IRQ_DATA.IrqIntTable[EventId] = IRQ_MASK32(EventId);

