circuitvalley/TMS320_DSP/moving_avg_filter_vc5502/lib/csl_intc.c
    return CSL_SOK;
}

/** ============================================================================
 *   @n@b IRQ_setVecs
 *
 *   @b Description
 *   @n It stores the Interrupt vector table address in Interrupt vector
 *     pointer DSP and Interrupt vector pointer host Registers
 *
 *   @b Arguments
 *   @verbatim
             Ivpd           Interrupt Vector Pointer Address
 *   @endverbatim
 *
 *   <b> Return Value </b>  CSL_Status
 *   @li                    CSL_SOK             - IRQ_enable is successful
 *   @li                    CSL_ESYS_BADHANDLE  - The handle is passed is
 *                                                invalid
 *   @li                    CSL_ESYS_INVPARAMS -  Invalid parameter
 *
 *   <b> Pre Condition </b>
 *   @n None
 *
 *   <b> Post Condition </b>
 *   @n  It sets IVPD and IVPH CPU Registers

 *   @b Modifies
 *   @n IVPD and IVPH CPU Registers
 *
 *   @b Example
 *   @verbatim
           // Interrupt Vector Table Address
            Uint32         Ivpd;
            CSL_Status     status;

            status = IRQ_setVecs(Ivpd);
     @endverbatim
 *  ============================================================================
 */

CSL_Status IRQ_setVecs( Uint32 Ivpd )
{
    Bool old_intm;
    Uint16 val = (Uint16)((Ivpd & CSL_CPU_IVPD_MASK) >> CSL_CPU_IVPD_SHIFT);
    old_intm = IRQ_globalDisable();
    IVPD = val;
    IVPH = val;
    IRQ_globalRestore(old_intm);

    return CSL_SOK;
}

/** ============================================================================
 *   @n@b IRQ_test
 *
 *   @b Description
 *   @n It gets the status bit for the particular Interupt from IFR Registers
 *
 *   @b Arguments
 *   @verbatim
             EventId           Interrupt Vector Pointer Address
 *           IntStatus         to store Interrupt Status bit in IFR Register
 *   @endverbatim
 *
 *   <b> Return Value </b>  CSL_Status
 *   @li                    CSL_SOK             - IRQ_enable is successful
 *   @li                    CSL_ESYS_BADHANDLE  - The handle is passed is
 *                                                invalid
 *   @li                    CSL_ESYS_INVPARAMS -  Invalid parameter
 *
 *   <b> Pre Condition </b>
 *   @n IRQ_init should be called before calling this API
 *
 *   <b> Post Condition </b>
 *   @n  It stores the IFR bit value in IntStatus variable

 *   @b Modifies
 *   @n 1. IntStatus - to store Interrupt flag bit
 *   @n
 *
 *   @b Example
 *   @verbatim
            Uint16         EventId;
            CSL_Status     status;
            bool           IntStatus;

            status = IRQ_test(EventId,&IntStatus);
     @endverbatim
 *  ============================================================================
 */

//CSL_Status IRQ_test(
//Uint16   EventId,
//Bool    *IntStatus
//)
//{
//    Uint16 bit;
//    Bool old_intm;
//    if(NULL == IntStatus)
//    {
//    return CSL_ESYS_INVPARAMS;
//    }
//    /* Wrong Event Id */
//    if(SINT31_EVENT < EventId)
//    {
//        return CSL_ESYS_INVPARAMS;
//    }
//    bit= EventId ;
//    old_intm = IRQ_globalDisable();
//
//    if(EventId > RCV2_EVENT)
//    {
//        bit = bit - XMT3_EVENT;
//        *IntStatus = CSL_FEXTR(CSL_CPU_REGS->IFR1, bit, bit);
//    }
//    else
//    {
//        *IntStatus = CSL_FEXTR(CSL_CPU_REGS->IFR0, bit, bit);
//    }
//    IRQ_globalRestore(old_intm);
//
//    return CSL_SOK;
//}

/** ============================================================================
 *   @n@b IRQ_globalDisable
 *
 *   @b Description
 *   @n It disables the interrupt globally by disabling INTM bit and also
 *      return the previous mask value for INTM bit
 *
 *   @b Arguments
 *   @verbatim

 *   @endverbatim
 *
 *   <b> Return Value </b>  Bool
 *   @li                    Old INTM bit value
 *
 *   <b> Pre Condition </b>
 *   @n  None
 *
 *   <b> Post Condition </b>
 *   @n  set INTM bit to 1 in ST1 CPU Register

 *   @b Modifies
 *      1. ST1 CPU Register
 *   @b Example
 *   @verbatim
            Bool oldMask;
            ....
            oldMask = IRQ_globalDisable();
     @endverbatim
 *  ============================================================================
 */
#define INTM 		(0x0001<<11)
Bool IRQ_globalDisable()
{
    Bool value;
	value = ST1_55&INTM;
    asm("\tNOP                      ;====> CODE AUTO-GENERATED by CSL");
    #ifdef ALGEBRAIC
    asm("\tBIT (ST1,#ST1_INTM) = #1   ;====> CODE AUTO-GENERATED by CSL");
    #else
    asm("\tBSET INTM                ;====> CODE AUTO-GENERATED by CSL");
    #endif

    return value;
}

/** ============================================================================
 *   @n@b IRQ_globalEnable
 *
 *   @b Description
 *   @n It enables the interrupt globally by enabling INTM bit and also
 *      return the previous mask value for INTM bit
 *
 *   @b Arguments
 *   @verbatim

 *   @endverbatim
 *
 *   <b> Return Value </b>  Bool
 *   @li                    Old INTM bit value
 *
 *   <b> Pre Condition </b>
 *   @n None
 *
 *   <b> Post Condition </b>
 *   @n  set INTM bit to 0 in ST1 CPU Register

 *   @b Modifies
 *      1.ST1 CPU Register
 *   @b Example
 *   @verbatim
            Bool oldMask;
            ....
            oldMask = IRQ_globalEnable();
     @endverbatim
 *  ============================================================================
 */

Bool IRQ_globalEnable()
{
    Bool value;
    value = ST1_55 & INTM;
    asm("\tNOP                      ;====> CODE AUTO-GENERATED by CSL");
    #ifdef ALGEBRAIC
    asm("\tBIT (ST1,#ST1_INTM) = #0    ;====> CODE AUTO-GENERATED by CSL");
    #else
    asm("\tBCLR INTM                ;====> CODE AUTO-GENERATED by CSL");
    #endif
    return value;
}

/** ============================================================================
 *   @n@b IRQ_globalRestore
 *
 *   @b Description
 *   @n It sets INTM bit to the value passed in the API
 *
 *   @b Arguments
 *   @verbatim
            val -  INTM bit value
 *   @endverbatim
 *
 *   <b> Return Value </b>  void
 *
 *   <b> Pre Condition </b>
 *   @n  IRQ_globalDisable or IRQ_globalEnable should be called
 *
 *   <b> Post Condition </b>
 *   @n  set or clear INTM bit in ST1 CPU Register

 *   @b Modifies
 *   1. ST1 CPU Register
 *   @b Example
 *   @verbatim
            Bool val;
            ....
            IRQ_globalRestore(val);
     @endverbatim
 *  ============================================================================
 */

void IRQ_globalRestore(
Bool value
)
{
    if(value)
    {
        asm("\tNOP                      ;====> CODE AUTO-GENERATED by CSL");
        #ifdef ALGEBRAIC
        asm("\tBIT (ST1,#ST1_INTM) = #1   ;====> CODE AUTO-GENERATED by CSL");
        #else
        asm("\tBSET INTM                ;====> CODE AUTO-GENERATED by CSL");
        #endif
    }

    else
    {
        asm("\tNOP                      ;====> CODE AUTO-GENERATED by CSL");
        #ifdef ALGEBRAIC
        asm("\tBIT (ST1,#ST1_INTM) = #0   ;====> CODE AUTO-GENERATED by CSL");
        #else
        asm("\tBCLR INTM                ;====> CODE AUTO-GENERATED by CSL");
        #endif
    }
}


